## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api.azurecaf_name.web_name will be created
  + resource "azurecaf_name" "web_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "api-mdk5mjg3yzm4o"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_app_service"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.api.azurerm_linux_web_app.web will be created
  + resource "azurerm_linux_web_app" "web" {
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "swedencentral"
      + name                              = (known after apply)
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "rg-prod"
      + service_plan_id                   = (sensitive value)
      + site_credential                   = (sensitive value)
      + tags                              = {
          + "azd-env-name"     = "prod"
          + "azd-service-name" = "api"
          + "managed-by"       = "terraform"
        }
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + application_logs {
              + file_system_level = "Verbose"
            }

          + http_logs {
              + file_system {
                  + retention_in_days = 1
                  + retention_in_mb   = 35
                }
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "FtpsOnly"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }
        }
    }

  # module.api.null_resource.webapp_basic_auth_disable will be created
  + resource "null_resource" "webapp_basic_auth_disable" {
      + id       = (known after apply)
      + triggers = {
          + "account" = (known after apply)
        }
    }

  # module.applicationinsights.azurecaf_name.applicationinsights_name will be created
  + resource "azurecaf_name" "applicationinsights_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "mdk5mjg3yzm4o"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_application_insights"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.applicationinsights.azurerm_application_insights.applicationinsights will be created
  + resource "azurerm_application_insights" "applicationinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "swedencentral"
      + name                                  = (known after apply)
      + resource_group_name                   = "rg-prod"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "azd-env-name" = "prod"
          + "managed-by"   = "terraform"
        }
      + workspace_id                          = (known after apply)
    }

  # module.applicationinsights.azurerm_portal_dashboard.board will be created
  + resource "azurerm_portal_dashboard" "board" {
      + dashboard_properties = (known after apply)
      + id                   = (known after apply)
      + location             = "swedencentral"
      + name                 = "dash-mdk5mjg3yzm4o"
      + resource_group_name  = "rg-prod"
      + tags                 = {
          + "azd-env-name" = "prod"
          + "managed-by"   = "terraform"
        }
    }

  # module.appserviceplan.azurecaf_name.plan_name will be created
  + resource "azurecaf_name" "plan_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "mdk5mjg3yzm4o"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_app_service_plan"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.appserviceplan.azurerm_service_plan.plan will be created
  + resource "azurerm_service_plan" "plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "swedencentral"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = (known after apply)
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-prod"
      + sku_name                     = "B1"
      + tags                         = {
          + "azd-env-name" = "prod"
          + "managed-by"   = "terraform"
        }
      + worker_count                 = (known after apply)
    }

  # module.cosmos.azurecaf_name.db_acc_name will be created
  + resource "azurecaf_name" "db_acc_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "mdk5mjg3yzm4o"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_cosmosdb_account"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.cosmos.azurerm_cosmosdb_account.db will be created
  + resource "azurerm_cosmosdb_account" "db" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = false
      + enable_free_tier                             = false
      + enable_multiple_write_locations              = false
      + endpoint                                     = (known after apply)
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "MongoDB"
      + local_authentication_disabled                = false
      + location                                     = "swedencentral"
      + mongo_server_version                         = "4.0"
      + name                                         = (known after apply)
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "rg-prod"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "azd-env-name" = "prod"
          + "managed-by"   = "terraform"
        }
      + write_endpoints                              = (known after apply)

      + capabilities {
          + name = "EnableServerless"
        }

      + consistency_policy {
          + consistency_level       = "Session"
          + max_interval_in_seconds = (known after apply)
          + max_staleness_prefix    = (known after apply)
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "swedencentral"
          + zone_redundant    = false
        }
    }

  # module.cosmos.azurerm_cosmosdb_mongo_collection.item will be created
  + resource "azurerm_cosmosdb_mongo_collection" "item" {
      + account_name        = (known after apply)
      + database_name       = "Todo"
      + id                  = (known after apply)
      + name                = "TodoItem"
      + resource_group_name = "rg-prod"
      + shard_key           = "_id"
      + system_indexes      = (known after apply)
      + throughput          = (known after apply)

      + index {
          + keys   = [
              + "_id",
            ]
          + unique = true
        }
    }

  # module.cosmos.azurerm_cosmosdb_mongo_collection.list will be created
  + resource "azurerm_cosmosdb_mongo_collection" "list" {
      + account_name        = (known after apply)
      + database_name       = "Todo"
      + id                  = (known after apply)
      + name                = "TodoList"
      + resource_group_name = "rg-prod"
      + shard_key           = "_id"
      + system_indexes      = (known after apply)
      + throughput          = (known after apply)

      + index {
          + keys   = [
              + "_id",
            ]
          + unique = true
        }
    }

  # module.cosmos.azurerm_cosmosdb_mongo_database.mongodb will be created
  + resource "azurerm_cosmosdb_mongo_database" "mongodb" {
      + account_name        = (known after apply)
      + id                  = (known after apply)
      + name                = "Todo"
      + resource_group_name = "rg-prod"
      + throughput          = (known after apply)
    }

  # module.keyvault.azurecaf_name.kv_name will be created
  + resource "azurecaf_name" "kv_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "mdk5mjg3yzm4o"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_key_vault"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.keyvault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rg-prod"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "azd-env-name" = "prod"
          + "managed-by"   = "terraform"
        }
      + tenant_id                     = "83a7e2a6-673b-47b6-a754-0bb5ba6e87d1"
      + vault_uri                     = (known after apply)
    }

  # module.keyvault.azurerm_key_vault_access_policy.app[0] will be created
  + resource "azurerm_key_vault_access_policy" "app" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (sensitive value)
      + secret_permissions = [
          + "Get",
          + "Set",
          + "List",
          + "Delete",
        ]
      + tenant_id          = "83a7e2a6-673b-47b6-a754-0bb5ba6e87d1"
    }

  # module.keyvault.azurerm_key_vault_secret.secrets[0] will be created
  + resource "azurerm_key_vault_secret" "secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = (sensitive value)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.loganalytics.azurecaf_name.workspace_name will be created
  + resource "azurecaf_name" "workspace_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "mdk5mjg3yzm4o"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.loganalytics.azurerm_log_analytics_workspace.workspace will be created
  + resource "azurerm_log_analytics_workspace" "workspace" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "swedencentral"
      + name                            = (known after apply)
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-prod"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "azd-env-name" = "prod"
          + "managed-by"   = "terraform"
        }
      + workspace_id                    = (known after apply)
    }

  # module.web.azurecaf_name.web_name will be created
  + resource "azurecaf_name" "web_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "web-mdk5mjg3yzm4o"
      + passthrough   = false
      + random_length = 0
      + resource_type = "azurerm_app_service"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.web.azurerm_linux_web_app.web will be created
  + resource "azurerm_linux_web_app" "web" {
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "swedencentral"
      + name                              = (known after apply)
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "rg-prod"
      + service_plan_id                   = (sensitive value)
      + site_credential                   = (sensitive value)
      + tags                              = {
          + "azd-env-name"     = "prod"
          + "azd-service-name" = "web"
          + "managed-by"       = "terraform"
        }
      + zip_deploy_file                   = (known after apply)

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + application_logs {
              + file_system_level = "Verbose"
            }

          + http_logs {
              + file_system {
                  + retention_in_days = 1
                  + retention_in_mb   = 35
                }
            }
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "./entrypoint.sh -o ./env-config.js && pm2 serve /home/site/wwwroot --no-daemon --spa"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "FtpsOnly"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }
        }
    }

  # module.web.null_resource.webapp_basic_auth_disable will be created
  + resource "null_resource" "webapp_basic_auth_disable" {
      + id       = (known after apply)
      + triggers = {
          + "account" = (known after apply)
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```
</details>